Revit 2015 API
Line Members
The Line type exposes the following members.
Methods
Name | Description
Clone
Returns a copy of this curve.
 (Inherited from Curve.)
ComputeDerivatives
 Returns the vectors describing the curve at the specified parameter.
 (Inherited from Curve.)
ComputeNormalizedParameter
Computes the normalized curve parameter from the raw parameter.
 (Inherited from Curve.)
ComputeRawParameter
Computes the raw parameter from the normalized parameter.
 (Inherited from Curve.)
CreateBound
 Creates a new instance of a bound linear curve.
CreateOffset
 Creates a new curve that is an offset of the existing curve.
 (Inherited from Curve.)
CreateReversed
 Creates a new curve with the opposite orientation of the existing curve.
 (Inherited from Curve.)
CreateTransformed
 Crates a new instance of a curve as a transformation of this curve.
 (Inherited from Curve.)
CreateUnbound
 Creates a new instance of an unbound linear curve.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Distance
Returns the shortest distance from the specified point to this curve.
 (Inherited from Curve.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
Evaluate
 Evaluates and returns the point that matches a parameter along the curve.
 (Inherited from Curve.)
GetEndParameter
 Returns the raw parameter value at the start or end of this curve.
 (Inherited from Curve.)
GetEndPoint
 Returns the 3D point at the start or end of this curve.
 (Inherited from Curve.)
GetEndPointReference
Returns a stable reference to the start point or the end point of the curve.
 (Inherited from Curve.)
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Intersect(Curve)
Calculates the intersection of this curve with the specified curve.
 (Inherited from Curve.)
Intersect(Curve, IntersectionResultArray)
Calculates the intersection of this curve with the specified curve and returns the intersection results.
 (Inherited from Curve.)
IsInside(Double)
Indicates whether the specified parameter value is within this curve's bounds.
 (Inherited from Curve.)
IsInside(Double, Int32)
Indicates whether the specified parameter value is within this curve's bounds and outputs the end index.
 (Inherited from Curve.)
MakeBound
Changes the bounds of this curve to the specified values.
 (Inherited from Curve.)
MakeUnbound
Makes this curve unbound.
 (Inherited from Curve.)
Project
Projects the specified point on this curve.
 (Inherited from Curve.)
Tessellate
Valid only if the curve is bound. Returns a polyline approximation to the curve.
 (Inherited from Curve.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ApproximateLength
The approximate length of the curve.
 (Inherited from Curve.)
Bound |  Obsolete.
Returns the bounded line between the specified points.
Direction
Returns the direction of the line.
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
IsBound
Describes whether the parameter of the curve is restricted to a particular interval.
 (Inherited from Curve.)
IsCyclic
The boolean value that indicates whether this curve is cyclic.
 (Inherited from Curve.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Length
The exact length of the curve.
 (Inherited from Curve.)
Origin
Returns the origin of the line.
Period
The period of this curve.
 (Inherited from Curve.)
Reference
Returns a stable reference to the curve.
 (Inherited from Curve.)
Unbound |  Obsolete.
Returns the unbounded line that passes through the specified point in the direction of the specified vector.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
Line Class
Autodesk.Revit.DB Namespace